package com.github.catvod.spider;

import android.content.Context;
import com.github.catvod.spider.merge.B0.a;
import com.github.catvod.spider.merge.C.C0017;
import com.github.catvod.spider.merge.E.m;
import com.github.catvod.spider.merge.F0.C0018;
import com.github.catvod.spider.merge.G.C0019;
import com.github.catvod.spider.merge.J0.C0021;
import com.github.catvod.spider.merge.K0.C0022;
import com.github.catvod.spider.merge.N.C0023;
import com.github.catvod.spider.merge.P0.C0024;
import com.github.catvod.spider.merge.Q0.C0025;
import com.github.catvod.spider.merge.Q0.C0026;
import com.github.catvod.spider.merge.S.C0027;
import com.github.catvod.spider.merge.S0.C0028;
import com.github.catvod.spider.merge.T0.C0030;
import com.github.catvod.spider.merge.V.C0031;
import com.github.catvod.spider.merge.V.C0032;
import com.github.catvod.spider.merge.V.C0033;
import com.github.catvod.spider.merge.W.C0034;
import com.github.catvod.spider.merge.Y.C0035;
import com.github.catvod.spider.merge.Y.C0036;
import com.github.catvod.spider.merge.Z.C0037;
import com.github.catvod.spider.merge.Z.C0039;
import com.github.catvod.spider.merge.Z.C0040;
import com.github.catvod.spider.merge.Z0.C0041;
import com.github.catvod.spider.merge.a0.C0042;
import com.github.catvod.spider.merge.b.C0044;
import com.github.catvod.spider.merge.b0.C0045;
import com.github.catvod.spider.merge.c1.C0046;
import com.github.catvod.spider.merge.d.C0047;
import com.github.catvod.spider.merge.d0.C0048;
import com.github.catvod.spider.merge.d1.C0049;
import com.github.catvod.spider.merge.d1.C0050;
import com.github.catvod.spider.merge.f.C0051;
import com.github.catvod.spider.merge.f0.C0052;
import com.github.catvod.spider.merge.f1.C0053;
import com.github.catvod.spider.merge.h.C0054;
import com.github.catvod.spider.merge.i0.C0055;
import com.github.catvod.spider.merge.p.C0057;
import com.github.catvod.spider.merge.q.C0058;
import com.github.catvod.spider.merge.r0.C0060;
import com.github.catvod.spider.merge.t.C0061;
import com.github.catvod.spider.merge.v.C0062;
import com.github.catvod.spider.merge.x0.C0063;
import com.github.catvod.spider.merge.y0.C0064;
import com.github.catvod.spider.merge.z.C0065;
import com.github.catvod.spider.p000mergexbpq.Q.C0000;
import com.github.catvod.spider.p000mergexbpq.Q.C0001;
import com.github.catvod.spider.p000mergexbpq.Q.C0002;
import com.github.catvod.spider.p000mergexbpq.R.C0003;
import com.github.catvod.spider.p000mergexbpq.S.C0004;
import com.github.catvod.spider.p000mergexbpq.S.C0005;
import com.github.catvod.spider.p000mergexbpq.a0.C0006;
import com.github.catvod.spider.p000mergexbpq.a0.C0007;
import com.github.catvod.spider.p000mergexbpq.b0.C0008;
import com.github.catvod.spider.p000mergexbpq.c.C0009;
import com.github.catvod.spider.p000mergexbpq.c0.C0010;
import com.github.catvod.spider.p000mergexbpq.e0.C0011;
import com.github.catvod.spider.p000mergexbpq.i.C0012;
import com.github.catvod.spider.p000mergexbpq.j.C0013;
import com.github.catvod.spider.p000mergexbpq.r.C0014;
import com.github.catvod.spider.p000mergexbpq.x.C0015;
import com.github.catvod.spider.p000mergexbpq.x.C0016;
import com.google.gson.JsonArray;
import com.google.gson.JsonElement;
import com.google.gson.JsonObject;
import com.google.gson.JsonPrimitive;
import java.util.ArrayList;
import java.util.HashMap;
import java.util.Iterator;
import java.util.List;
import okhttp3.Call;
import okhttp3.MediaType;
import okhttp3.OkHttpClient;
import okhttp3.Request;
import okhttp3.RequestBody;
import okhttp3.Response;
import okhttp3.ResponseBody;

/* loaded from: classes.dex */
public class HByingSo extends Cloud {

    /* renamed from: short, reason: not valid java name */
    private static final short[] f68short = {3242, 2096, 2096, 1456, 1441, 1441, 1469, 1464, 1458, 1456, 1445, 1464, 1470, 1471, 1534, 1467, 1442, 1470, 1471, 711, 670, 725, 728, 670, 646, 2764, 1217, 1245, 1245, 1241, 1242, 1171, 1158, 1158, 1232, 1242, 1224, 1241, 1216, 1159, 1232, 1216, 1223, 1230, 1242, 1222, 1159, 1231, 1244, 1223, 1158, 1228, 1217, 1219, 1158, 1224, 1221, 1216, 1158, 1230, 1228, 1245, 1250, 1228, 1232, 291, 261, 275, 260, 347, 311, 273, 275, 280, 258, 1675, 1705, 1724, 1711, 1706, 1706, 1703, 1769, 1779, 1768, 1782, 1766, 1774, 1681, 1711, 1704, 1698, 1705, 1713, 1717, 1766, 1672, 1682, 1766, 1783, 1782, 1768, 1782, 1789, 1766, 1681, 1711, 1704, 1776, 1778, 1789, 1766, 1726, 1776, 1778, 1775, 1766, 1671, 1718, 1718, 1706, 1699, 1681, 1699, 1700, 1677, 1711, 1714, 1769, 1779, 1781, 1777, 1768, 1781, 1776, 1766, 1774, 1677, 1678, 1682, 1675, 1674, 1770, 1766, 1706, 1711, 1709, 1699, 1766, 1665, 1699, 1701, 1709, 1705, 1775, 1766, 1669, 1710, 1716, 1705, 1707, 1699, 1769, 1783, 1781, 1779, 1768, 1782, 1768, 1782, 1768, 1782, 1766, 1685, 1703, 1696, 1703, 1716, 1711, 1769, 1779, 1781, 1777, 1768, 1781, 1776, 2581, 2617, 2616, 2594, 2611, 2616, 2594, 2683, 2562, 2607, 2598, 2611, 1522, 1508, 1506, 1452, 1506, 1513, 1452, 1524, 1504, 1452, 1521, 1517, 1504, 1525, 1511, 1518, 1523, 1516, 2192, 2277, 2267, 2268, 2262, 2269, 2245, 2241, 2192, 1936, 1926, 1920, 1998, 1920, 1931, 1998, 1942, 1922, 1292, 1385, 1345, 1345, 1353, 1346, 1355, 1294, 1389, 1350, 1372, 1345, 1347, 1355, 1292, 1301, 1368, 1299, 1292, 1311, 1309, 1307, 1292, 1282, 1294, 1292, 1376, 1345, 1370, 1283, 1391, 1280, 1388, 1372, 1359, 1344, 1354, 1292, 1301, 1368, 1299, 1292, 1302, 1292, 1282, 1294, 1292, 1389, 1350, 1372, 1345, 1347, 1351, 1371, 1347, 1292, 1301, 1368, 1299, 1292, 1311, 1309, 1307, 1292, 2469, 2483, 2485, 2555, 2485, 2494, 2555, 2467, 2487, 2555, 2491, 2489, 2484, 2495, 2490, 2483, 2154, 2149, 2650, 2631, 2652, 2642, 2652, 2651, 847, 851, 851, 855, 852, 797, 776, 776, 862, 846, 841, 832, 852, 840, 777, 833, 850, 841, 2892, 2906, 2908, 2834, 2905, 2906, 2891, 2908, 2903, 2834, 2892, 2902, 2891, 2906, 2339, 2353, 2365, 2357, 2429, 2339, 2361, 2340, 2357, 2465, 2487, 2481, 2559, 2484, 2487, 2470, 2481, 2490, 2559, 2495, 2493, 2486, 2487, 1062, 1066, 1079, 1078, 1227, 1245, 1243, 1173, 1246, 1245, 1228, 1243, 1232, 1173, 1244, 1245, 1227, 1228, 2204, 2196, 2185, 2189, 2176, 707, 724, 727, 724, 707, 724, 707, 1065, 1077, 1077, 1073, 1074, 1147, 1134, 1134, 1080, 1064, 1071, 1062, 1074, 1070, 1135, 1063, 1076, 1071, 1134, 1717, 1719, 1719, 1713, 1700, 1696, 1785, 1720, 1717, 1722, 1715, 1697, 1717, 1715, 1713, 3288, 3274, 3215, 3297, 3308, 3214, 3288, 3274, 3225, 3283, 3231, 3218, 3212, 3227, 1214, 1212, 1191, 1185, 1212, 1191, 1210, 1207, 1431, 1503, 1491, 1486, 1474, 1419, 2878, 2875, 2862, 2875, 472, 1161, 1173, 1173, 1169, 1170, 1243, 1230, 1230, 1157, 1171, 1160, 1175, 1156, 1231, 1172, 1154, 1231, 1154, 1167, 1230, 1170, 1230, 599, 587, 587, 591, 588, 517, 528, 528, 587, 588, 602, 524, 530, 594, 594, 529, 604, 593, 529, 605, 598, 593, 600, 529, 593, 602, 587, 528, 587, 599, 528, 598, 603, 528, 624, 630, 623, 530, 636, 529, 598, 526, 582, 521, 637, 627, 634, 592, 626, 629, 592, 597, 626, 617, 591, 634, 608, 524, 594, 632, 613, 622, 631, 606, 631, 606, 512, 584, 514, 526, 522, 520, 537, 599, 514, 526, 519, 527, 537, 604, 514, 520, 537, 589, 514, 527, 537, 592, 514, 522, 537, 591, 598, 603, 514, 526, 529, 520, 2282, 1286, 1306, 1306, 1310, 1309, 1364, 1345, 1345, 1310, 1295, 1280, 1344, 1311, 1307, 1295, 1308, 1285, 1344, 1293, 1280, 1345, 1309, 1345, 268, 272, 272, 276, 279, 350, 331, 331, 272, 279, 257, 343, 329, 265, 265, 330, 263, 266, 330, 262, 269, 266, 259, 330, 266, 257, 272, 331, 272, 268, 331, 269, 256, 331, 299, 301, 308, 329, 295, 330, 318, 262, 277, 295, 285, 269, 310, 275, 336, 339, 284, 348, 271, 295, 305, 289, 296, 275, 301, 329, 348, 309, 300, 261, 290, 289, 347, 275, 345, 342, 343, 348, 322, 268, 345, 341, 348, 340, 322, 263, 345, 339, 322, 278, 345, 340, 322, 267, 345, 337, 322, 276, 269, 256, 345, 341, 330, 339, 2908, 2997, 2985, 2985, 2989, 2990, 3047, 3058, 3058, 2989, 3004, 2995, 3059, 2981, 2984, 2995, 2993, 3000, 2996, 3059, 3006, 2994, 2992, 3058, 2990, 3058, 1112, 1092, 1092, 1088, 1091, 1034, 1055, 1055, 1092, 1091, 1109, 1025, 1053, 1117, 1117, 1054, 1107, 1118, 1054, 1106, 1113, 1118, 1111, 1054, 1118, 1109, 1092, 1055, 1092, 1112, 1055, 1113, 1108, 1055, 1151, 1145, 1120, 1053, 1139, 1054, 1110, 1053, 1111, 1091, 1026, 1031, 1092, 1092, 1129, 1032, 1108, 1028, 1143, 1137, 1139, 1027, 1032, 1095, 1130, 1140, 1097, 1111, 1137, 1137, 1137, 1137, 1039, 1095, 1037, 1025, 1027, 1026, 1046, 1112, 1037, 1025, 1032, 1024, 1046, 1107, 1037, 1031, 1046, 1090, 1037, 1024, 1046, 1119, 1037, 1029, 1046, 1088, 1113, 1108, 1037, 1025, 1054, 1031, 2057, 1593, 1573, 1573, 1569, 1570, 1643, 1662, 1662, 1569, 1584, 1599, 1663, 1587, 1584, 1592, 1589, 1572, 1663, 1586, 1598, 1596, 1662, 1570, 1662, 3080, 3092, 3092, 3088, 3091, 3162, 3151, 3151, 3092, 3091, 3077, 3154, 3149, 3085, 3085, 3150, 3075, 3086, 3150, 3074, 3081, 3086, 3079, 3150, 3086, 3077, 3092, 3151, 3092, 3080, 3151, 3081, 3076, 3151, 3119, 3113, 3120, 3149, 3107, 3150, 3124, 3111, 3076, 3094, 3127, 3096, 3098, 3091, 3095, 3107, 3076, 3088, 3109, 3129, 3160, 3096, 3110, 3096, 3114, 3129, 3092, 3095, 3112, 3073, 3112, 3073, 3167, 3095, 3165, 3153, 3159, 3158, 3142, 3080, 3165, 3153, 3160, 3152, 3142, 3075, 3165, 3159, 3142, 3090, 3165, 3152, 3142, 3087, 3165, 3157, 3142, 3088, 3081, 3076, 3165, 3153, 3150, 3159, 2467, 2552, 2441, 2467, 2467, 2467, 2467, 2467, 2467, 2467, 2467, 2465, 2535, 2550, 2551, 2540, 2536, 2534, 2541, 2465, 2489, 2465, 2465, 2479, 2441, 2467, 2467, 2467, 2467, 2467, 2467, 2467, 2467, 2465, 2547, 2482, 2481, 
    2480, 2551, 2540, 2536, 2534, 2541, 2465, 2489, 2465, 2465, 2479, 2441, 2467, 2467, 2467, 2467, 2467, 2467, 2467, 2467, 2465, 2551, 2540, 2536, 2534, 2541, 2465, 2489, 2467, 2465, 2465, 2479, 2441, 2467, 2467, 2467, 2467, 2467, 2467, 2467, 2467, 2465, 2528, 2540, 2540, 2536, 2538, 2534, 2465, 2489, 2467, 2465, 2465, 2479, 2441, 2467, 2467, 2467, 2467, 2467, 2467, 2467, 2467, 2465, 2550, 2528, 2528, 2540, 2540, 2536, 2538, 2534, 2465, 2489, 2465, 2465, 2479, 2441, 2467, 2467, 2467, 2467, 2467, 2467, 2467, 2467, 2465, 2544, 2538, 2551, 2534, 2465, 2489, 2467, 2465, 2465, 2441, 2467, 2467, 2467, 2467, 2467, 2467, 2558, 1614, 1557, 1636, 1614, 1614, 1614, 1614, 1614, 1614, 1614, 1614, 1612, 1546, 1563, 1562, 1537, 1541, 1547, 1536, 1612, 1620, 1612, 1612, 1602, 1636, 1614, 1614, 1614, 1614, 1614, 1614, 1614, 1614, 1612, 1566, 1631, 1628, 1629, 1562, 1537, 1541, 1547, 1536, 1612, 1620, 1612, 1612, 1602, 1636, 1614, 1614, 1614, 1614, 1614, 1614, 1614, 1614, 1612, 1562, 1537, 1541, 1547, 1536, 1612, 1620, 1614, 1612, 1612, 1602, 1636, 1614, 1614, 1614, 1614, 1614, 1614, 1614, 1614, 1612, 1549, 1537, 1537, 1541, 1543, 1547, 1612, 1620, 1614, 1612, 1612, 1602, 1636, 1614, 1614, 1614, 1614, 1614, 1614, 1614, 1614, 1612, 1563, 1549, 1549, 1537, 1537, 1541, 1543, 1547, 1612, 1620, 1612, 1612, 1602, 1636, 1614, 1614, 1614, 1614, 1614, 1614, 1614, 1614, 1612, 1565, 1543, 1562, 1547, 1612, 1620, 1614, 1612, 1612, 1636, 1614, 1614, 1614, 1614, 1614, 1614, 1555, 467, 1587, 1570, 1570, 1598, 1595, 1585, 1587, 1574, 1595, 1597, 1596, 1661, 1592, 1569, 1597, 1596, 1518, 1463, 1509, 1524, 1522, 1520, 1478, 1532, 1519, 1520, 1463, 1455, 1446, 1445, 1465, 1463, 1509, 1524, 1522, 1520, 1499, 1504, 1528, 1463, 1455, 1444, 1465, 1463, 1505, 1532, 1505, 1529, 1520, 1463, 1455, 1463, 894, 880, 894, 814, 819, 819, 808, 894, 870, 2718, 2704, 2769, 2771, 2758, 2704, 2696, 2704, 2771, 2782, 2782, 2704, 2718, 2704, 2777, 2775, 2763, 2704, 2696, 2704, 2698, 2695, 2754, 2776, 2798, 2759, 2690, 2690, 2690, 2775, 2753, 2692, 2798, 2772, 2774, 2762, 2798, 2759, 2690, 2690, 2691, 2689, 2764, 2768, 2798, 2759, 2690, 2690, 2690, 2692, 2694, 2697, 2808, 2692, 2702, 2805, 2688, 2693, 2806, 2703, 2691, 2805, 2702, 2757, 2805, 2774, 2755, 2798, 2759, 2690, 2690, 2690, 2694, 2782, 2754, 2814, 2776, 2754, 2695, 2699, 2704, 2767, 1947, 1927, 1927, 1923, 1920, 1993, 2012, 2012, 1930, 1920, 1938, 1923, 1946, 2013, 1930, 1946, 1949, 1940, 1920, 1948, 2013, 1941, 1926, 1949, 2012, 1942, 1947, 1945, 2012, 1938, 1951, 1946, 2012, 1920, 1942, 1938, 1921, 1936, 1947, 549, 515, 533, 514, 605, 561, 535, 533, 542, 516, 692, 662, 643, 656, 661, 661, 664, 726, 716, 727, 713, 729, 721, 686, 656, 663, 669, 662, 654, 650, 729, 695, 685, 729, 712, 713, 727, 713, 706, 729, 686, 656, 663, 719, 717, 706, 729, 641, 719, 717, 720, 729, 696, 649, 649, 661, 668, 686, 668, 667, 690, 656, 653, 726, 716, 714, 718, 727, 714, 719, 729, 721, 690, 689, 685, 692, 693, 725, 729, 661, 656, 658, 668, 729, 702, 668, 666, 658, 662, 720, 729, 698, 657, 651, 662, 660, 668, 726, 712, 714, 716, 727, 713, 727, 713, 727, 713, 729, 682, 664, 671, 664, 651, 656, 726, 716, 714, 718, 727, 714, 719, 2396, 2416, 2417, 2411, 2426, 2417, 2411, 2354, 2379, 2406, 2415, 2426, 1371, 1357, 1355, 1285, 1355, 1344, 1285, 1373, 1353, 1285, 1368, 1348, 1353, 1372, 1358, 1351, 1370, 1349, 2833, 2916, 2906, 2909, 2903, 2908, 2884, 2880, 2833, 767, 745, 751, 673, 751, 740, 673, 761, 749, 528, 629, 605, 605, 597, 606, 599, 530, 625, 602, 576, 605, 607, 599, 528, 521, 580, 527, 528, 515, 513, 519, 528, 542, 530, 528, 636, 605, 582, 543, 627, 540, 624, 576, 595, 604, 598, 528, 521, 580, 527, 528, 522, 528, 542, 530, 528, 625, 602, 576, 605, 607, 603, 583, 607, 528, 521, 580, 527, 528, 515, 513, 519, 528, 947, 933, 931, 1005, 931, 936, 1005, 949, 929, 1005, 941, 943, 930, 937, 940, 933, 2209, 2222, 2812, 2785, 2810, 2804, 2810, 2813, 3098, 3078, 3078, 3074, 3073, 3144, 3165, 3165, 3083, 3099, 3100, 3093, 3073, 3101, 3164, 3092, 3079, 3100, 778, 796, 794, 852, 799, 796, 781, 794, 785, 852, 778, 784, 781, 796, 1917, 1903, 1891, 1899, 1827, 1917, 1895, 1914, 1899, 1258, 1276, 1274, 1204, 1279, 1276, 1261, 1274, 1265, 1204, 1268, 1270, 1277, 1276, 978, 990, 963, 962, 3280, 3270, 3264, 3214, 3269, 3270, 3287, 3264, 3275, 3214, 3271, 3270, 3280, 3287, 1859, 1867, 1878, 1874, 1887, 766, 745, 746, 745, 766, 745, 766, 1579, 1591, 1591, 1587, 1584, 1657, 1644, 1644, 1594, 1578, 1581, 1572, 1584, 1580, 1645, 1573, 1590, 1581, 1644, 2578, 2576, 2576, 2582, 2563, 2567, 2654, 2591, 2578, 2589, 2580, 2566, 2578, 2580, 2582, 1908, 1894, 1827, 1869, 1856, 1826, 1908, 1894, 1845, 1919, 1843, 1854, 1824, 1847, 3282, 3280, 3275, 3277, 3280, 3275, 3286, 3291, 1101, 1029, 1033, 1044, 1048, 1105, 1797, 1792, 1813, 1792, 1321, 1332, 1321, 1329, 1336, 1028, 1045, 1038, 1198, 1213, 1188, 541, 526, 541, 2789, 2792, 1633, 1633, 2756, 2777, 2777, 2754, 1460, 1955, 1983, 1983, 1979, 1976, 2033, 2020, 2020, 1983, 1976, 1966, 2040, 2022, 1958, 1958, 2021, 1960, 1957, 2021, 1961, 1954, 1957, 1964, 2021, 1957, 1966, 1983, 2020, 1983, 1955, 2020, 1954, 1967, 2020, 1924, 1922, 1947, 2022, 1928, 2021, 1954, 2042, 1970, 2045, 1929, 1927, 1934, 1956, 1926, 1921, 1956, 1953, 1926, 1949, 1979, 1934, 1940, 2040, 1958, 1932, 1937, 1946, 1923, 1962, 1923, 1962, 2036, 1980, 2038, 2042, 2046, 2044, 2029, 1955, 2038, 2042, 2035, 2043, 2029, 1960, 2038, 2044, 2029, 1977, 2038, 2043, 2029, 1956, 2038, 2046, 2029, 1979, 1954, 1967, 2038, 2042, 2021, 2044, 698, 1414, 1434, 1434, 1438, 1437, 1492, 1473, 1473, 1434, 1437, 1419, 1501, 1475, 1411, 1411, 1472, 1421, 1408, 1472, 1420, 1415, 1408, 1417, 1472, 1408, 1419, 1434, 1473, 1434, 1414, 1473, 1415, 1418, 1473, 1441, 1447, 1470, 1475, 1453, 1472, 1460, 1420, 
    1439, 1453, 1431, 1415, 1468, 1433, 1498, 1497, 1430, 1494, 1413, 1453, 1467, 1451, 1442, 1433, 1447, 1475, 1494, 1471, 1446, 1423, 1448, 1451, 1489, 1433, 1491, 1500, 1501, 1494, 1480, 1414, 1491, 1503, 1494, 1502, 1480, 1421, 1491, 1497, 1480, 1436, 1491, 1502, 1480, 1409, 1491, 1499, 1480, 1438, 1415, 1418, 1491, 1503, 1472, 1497, 1755, 600, 580, 580, 576, 579, 522, 543, 543, 580, 579, 597, 513, 541, 605, 605, 542, 595, 606, 542, 594, 601, 606, 599, 542, 606, 597, 580, 543, 580, 600, 543, 601, 596, 543, 639, 633, 608, 541, 627, 542, 598, 541, 599, 579, 514, 519, 580, 580, 617, 520, 596, 516, 631, 625, 627, 515, 520, 583, 618, 628, 585, 599, 625, 625, 625, 625, 527, 583, 525, 513, 515, 514, 534, 600, 525, 513, 520, 512, 534, 595, 525, 519, 534, 578, 525, 512, 534, 607, 525, 517, 534, 576, 601, 596, 525, 513, 542, 519, 1525, 1512, 1524, 1524, 1520, 1523, 1466, 1455, 1455, 1524, 1523, 1509, 1458, 1453, 1517, 1517, 1454, 1507, 1518, 1454, 1506, 1513, 1518, 1511, 1454, 1518, 1509, 1524, 1455, 1524, 1512, 1455, 1513, 1508, 1455, 1487, 1481, 1488, 1453, 1475, 1454, 1492, 1479, 1508, 1526, 1495, 1528, 1530, 1523, 1527, 1475, 1508, 1520, 1477, 1497, 1464, 1528, 1478, 1528, 1482, 1497, 1524, 1527, 1480, 1505, 1480, 1505, 1471, 1527, 1469, 1457, 1463, 1462, 1446, 1512, 1469, 1457, 1464, 1456, 1446, 1507, 1469, 1463, 1446, 1522, 1469, 1456, 1446, 1519, 1469, 1461, 1446, 1520, 1513, 1508, 1469, 1457, 1454, 1463, 2490, 2488, 2477, 2790, 2799, 22367, 27356, 2709, 2710, 29329, -29161, 2716, 2699, 31081, -31334, 24123, 1043, 1038, 30531, 23815};
    public String g = C0061.m9361(m424(), 0, 1, 3226);

    /* renamed from: ۣ۟۟ۤۡ, reason: not valid java name and contains not printable characters */
    public static String m416(Object obj) {
        if (C0023.m4566() < 0) {
            return ((JsonPrimitive) obj).getAsString();
        }
        return null;
    }

    /* renamed from: ۣ۟ۢ۠ۥ, reason: not valid java name and contains not printable characters */
    public static Iterator m417(Object obj) {
        if (C0041.m6823() <= 0) {
            return ((JsonArray) obj).iterator();
        }
        return null;
    }

    /* renamed from: ۣ۟ۥۨ, reason: not valid java name and contains not printable characters */
    public static Request.Builder m418(Object obj, Object obj2) {
        if (C0052.m8320() >= 0) {
            return ((Request.Builder) obj).post((RequestBody) obj2);
        }
        return null;
    }

    /* renamed from: ۟ۤۢۧ۠, reason: not valid java name and contains not printable characters */
    public static RequestBody m419(Object obj, Object obj2) {
        if (C0010.m2320() <= 0) {
            return RequestBody.create((MediaType) obj, (String) obj2);
        }
        return null;
    }

    /* renamed from: ۣ۟ۤۦ, reason: not valid java name and contains not printable characters */
    public static Request m420(Object obj, Object obj2, Object obj3, Object obj4, Object obj5) {
        if (C0063.m9589() <= 0) {
            return a.v((Request.Builder) obj, (String) obj2, (String) obj3, (String) obj4, (String) obj5);
        }
        return null;
    }

    /* renamed from: ۟ۤۥۧۤ, reason: not valid java name and contains not printable characters */
    public static JsonArray m421(Object obj, Object obj2) {
        if (C0013.m3167() >= 0) {
            return ((JsonObject) obj).getAsJsonArray((String) obj2);
        }
        return null;
    }

    /* renamed from: ۟ۥۨۨۢ, reason: not valid java name and contains not printable characters */
    public static Response m422(Object obj) {
        if (C0054.m8557() <= 0) {
            return ((Call) obj).execute();
        }
        return null;
    }

    /* renamed from: ۟ۦۣۤۡ, reason: not valid java name and contains not printable characters */
    public static String m423(Object obj) {
        if (C0052.m8320() >= 0) {
            return ((ResponseBody) obj).string();
        }
        return null;
    }

    /* renamed from: ۠ۥۡۧ, reason: not valid java name and contains not printable characters */
    public static short[] m424() {
        if (C0012.m3024() > 0) {
            return f68short;
        }
        return null;
    }

    /* renamed from: ۡ۠۠ۦ, reason: not valid java name and contains not printable characters */
    public static MediaType m425(Object obj) {
        if (C0052.m8320() > 0) {
            return MediaType.parse((String) obj);
        }
        return null;
    }

    /* renamed from: ۣۦۧۦ, reason: not valid java name and contains not printable characters */
    public static JsonPrimitive m426(Object obj, Object obj2) {
        if (C0058.m9131() <= 0) {
            return ((JsonObject) obj).getAsJsonPrimitive((String) obj2);
        }
        return null;
    }

    /* renamed from: ۤۡ۠ۨ, reason: not valid java name and contains not printable characters */
    public static Request.Builder m427(Object obj, Object obj2) {
        if (C0001.m1164() <= 0) {
            return ((Request.Builder) obj).url((String) obj2);
        }
        return null;
    }

    /* renamed from: ۦۡۧ۠, reason: contains not printable characters */
    public static Request.Builder m428(Object obj, Object obj2, Object obj3) {
        if (C0016.m3596() < 0) {
            return ((Request.Builder) obj).addHeader((String) obj2, (String) obj3);
        }
        return null;
    }

    /* renamed from: ۧۥۨۡ, reason: not valid java name and contains not printable characters */
    public static Call m429(Object obj, Object obj2) {
        if (C0022.m4497() > 0) {
            return ((OkHttpClient) obj).newCall((Request) obj2);
        }
        return null;
    }

    /* renamed from: ۣۣۨۤ, reason: not valid java name and contains not printable characters */
    public static JsonObject m430(Object obj) {
        if (C0040.m6582() >= 0) {
            return ((JsonElement) obj).getAsJsonObject();
        }
        return null;
    }

    /* renamed from: ۨۨۥۡ, reason: not valid java name and contains not printable characters */
    public static ResponseBody m431(Object obj) {
        if (C0022.m4497() > 0) {
            return ((Response) obj).body();
        }
        return null;
    }

    public String categoryContent(String str, String str2, boolean z, HashMap<String, String> map) {
        return C0007.m1840();
    }

    @Override // com.github.catvod.spider.Cloud
    public String detailContent(List<String> list) {
        String strM1840;
        String strM1398;
        String[] strArrM4752 = C0024.m4752((String) C0048.m7915(list, 0), C0019.m4107(m424(), 1, 2, 2126));
        OkHttpClient okHttpClient = new OkHttpClient();
        String strM6779 = C0041.m6779(m424(), 3, 16, 1489);
        MediaType mediaTypeM425 = m425(strM6779);
        StringBuilder sb = new StringBuilder(C0022.m4403(m424(), 19, 6, 700));
        C0018.m3933(sb, strArrM4752[0]);
        C0018.m3933(sb, C0042.m7151(m424(), 25, 1, 2737));
        String strM416 = m416(m426((JsonObject) C0033.m5856(m423(m431(m422(m429(okHttpClient, m420(m428(m428(m428(m428(m428(m428(m428(m428(m428(m428(m418(m427(new Request.Builder(), C0023.m4536(m424(), 26, 39, 1193)), m419(mediaTypeM425, C0047.m7763(sb))), C0036.m6188(m424(), 65, 10, 374), C0039.m6551(m424(), 75, 111, 1734)), C0016.m3525(m424(), 186, 12, 2646), strM6779), C0014.m3332(m424(), 198, 18, 1409), C0013.m3106(m424(), 216, 9, 2226)), C0049.m8007(m424(), 225, 9, 2019), C0006.m1774(m424(), 234, 64, 1326)), C0012.m2973(m424(), 298, 16, 2518), C0009.m2037(m424(), 314, 2, 2133)), C0018.m3917(m424(), 316, 6, 2613), C0057.m8978(m424(), 322, 18, 807)), C0027.m5062(m424(), 340, 14, 2879), C0017.m3646(m424(), 354, 9, 2384)), C0039.m6551(m424(), 363, 14, 2514), C0017.m3646(m424(), 377, 4, 1093)), C0042.m7151(m424(), 381, 14, 1208), C0033.m5852(m424(), 395, 5, 2297)), C0048.m7902(m424(), 400, 7, 689), C0050.m8131(m424(), 407, 19, 1089)), C0023.m4536(m424(), 426, 15, 1748), C0051.m8259(m424(), 441, 14, 3234), C0055.m8814(m424(), 455, 8, 1230), C0040.m6584(m424(), 463, 6, 1506)))))), JsonObject.class), C0065.m9775(m424(), 469, 4, 2906)));
        String str = strArrM4752[1];
        if (C0007.m1815(str, C0019.m4107(m424(), 473, 1, 489))) {
            strM1840 = C0026.m4915(C0061.m9361(m424(), 474, 22, 1249), strM416);
            strM1398 = C0035.m6131(m424(), 496, 98, 575);
        } else if (C0007.m1815(str, C0005.m1645(m424(), 594, 1, 2264))) {
            strM1840 = C0026.m4915(C0040.m6584(m424(), 595, 23, 1390), strM416);
            strM1398 = C0001.m1189(m424(), 618, 98, 356);
        } else if (C0007.m1815(str, C0058.m9106(m424(), 716, 1, 2927))) {
            strM1840 = C0026.m4915(C0012.m2973(m424(), 717, 25, 3037), strM416);
            strM1398 = C0003.m1398(m424(), 742, 98, 1072);
        } else if (C0007.m1815(str, C0062.m9389(m424(), 840, 1, 2109))) {
            strM1840 = C0026.m4915(C0000.m1077(m424(), 841, 24, 1617), strM416);
            strM1398 = C0003.m1398(m424(), 865, 98, 3168);
        } else {
            strM1840 = C0007.m1840();
            strM1398 = strM1840;
        }
        m mVar = new m();
        C0027.m5000(mVar, C0055.m8703());
        C0011.m2828(mVar, (String) C0048.m7915(list, 0));
        C0026.m4947(mVar, strM1398);
        C0005.m1628(mVar, strArrM4752[2]);
        ArrayList arrayList = new ArrayList();
        C0004.m1532(arrayList, strM1840);
        C0019.m4073(mVar, C0036.m6189());
        C0044.m7449(mVar, C0014.m3356(this, arrayList));
        C0054.m8596(mVar, C0030.m5351(this));
        return C0053.m8428(mVar);
    }

    public String homeContent(boolean z) {
        return C0007.m1840();
    }

    public void init(Context context) {
        C0051.m8194(C0035.m6110());
        super.init(context, C0026.m4951(m424(), 963, 141, 2435));
    }

    @Override // com.github.catvod.spider.Cloud
    public void init(Context context, String str) {
        C0051.m8194(C0035.m6110());
        this.g = str;
        super.init(context, C0057.m8978(m424(), 1104, 141, 1646));
    }

    public String searchContent(String str, boolean z) {
        return C0064.m9667(this, str, true, C0013.m3106(m424(), 1245, 1, 482));
    }

    public String searchContent(String str, boolean z, String str2) {
        ArrayList arrayList = new ArrayList();
        OkHttpClient okHttpClient = new OkHttpClient();
        String strM7902 = C0048.m7902(m424(), 1246, 16, 1618);
        MediaType mediaTypeM425 = m425(strM7902);
        StringBuilder sbM7672 = C0046.m7672(C0023.m4536(m424(), 1262, 36, 1429), str, C0019.m4107(m424(), 1298, 9, 860));
        C0018.m3933(sbM7672, C0006.m1744(this));
        C0018.m3933(sbM7672, C0025.m4795(m424(), 1307, 82, 2738));
        Iterator itM417 = m417(m421((JsonObject) C0033.m5856(m423(m431(m422(m429(okHttpClient, m420(m428(m428(m428(m428(m428(m428(m428(m428(m428(m428(m418(m427(new Request.Builder(), C0003.m1398(m424(), 1389, 39, 2035)), m419(mediaTypeM425, C0047.m7763(sbM7672))), C0063.m9585(m424(), 1428, 10, 624), C0011.m2805(m424(), 1438, 111, 761)), C0065.m9775(m424(), 1549, 12, 2335), strM7902), C0025.m4795(m424(), 1561, 18, 1320), C0037.m6307(m424(), 1579, 9, 2867)), C0019.m4107(m424(), 1588, 9, 652), C0054.m8574(m424(), 1597, 64, 562)), C0041.m6779(m424(), 1661, 16, 960), C0019.m4107(m424(), 1677, 2, 2206)), C0025.m4795(m424(), 1679, 6, 2707), C0032.m5708(m424(), 1685, 18, 3186)), C0006.m1774(m424(), 1703, 14, 889), C0031.m5565(m424(), 1717, 9, 1806)), C0040.m6584(m424(), 1726, 14, 1177), C0005.m1645(m424(), 1740, 4, 945)), C0047.m7833(m424(), 1744, 14, 3235), C0050.m8131(m424(), 1758, 5, 1830)), C0016.m3525(m424(), 1763, 7, 652), C0009.m2037(m424(), 1770, 19, 1603)), C0054.m8574(m424(), 1789, 15, 2675), C0036.m6188(m424(), 1804, 14, 1806), C0037.m6307(m424(), 1818, 8, 3234), C0048.m7902(m424(), 1826, 6, 1080)))))), JsonObject.class), C0060.m9352(m424(), 1832, 4, 1889)));
        while (C0012.m2962(itM417)) {
            JsonObject jsonObjectM430 = m430((JsonElement) C0048.m7949(itM417));
            String strM416 = m416(m426(jsonObjectM430, C0008.m1970(m424(), 1836, 5, 1373)));
            if (!C0058.m9127(strM416, C0062.m9389(m424(), 1841, 3, 1125)) && !C0058.m9127(strM416, C0015.m3484(m424(), 1844, 3, 1236)) && !C0058.m9127(strM416, C0034.m6001(m424(), 1847, 3, 623))) {
                StringBuilder sb = new StringBuilder();
                C0018.m3933(sb, m416(m426(jsonObjectM430, C0012.m2973(m424(), 1850, 2, 2700))));
                String strM8337 = C0052.m8337(m424(), 1852, 2, 1567);
                C0018.m3933(sb, strM8337);
                String strM8477 = C0053.m8477(m424(), 1854, 4, 2742);
                C0018.m3933(sb, m416(m426(jsonObjectM430, strM8477)));
                String strM5188 = C0028.m5188(sb, strM8337, strM416);
                String strM4162 = m416(m426(jsonObjectM430, strM8477));
                String strM6779 = C0007.m1815(strM4162, C0045.m7657(m424(), 1858, 1, 1413)) ? C0041.m6779(m424(), 1859, 98, 1995) : C0007.m1815(strM4162, C0049.m8007(m424(), 1957, 1, 648)) ? C0046.m7718(m424(), 1958, 98, 1518) : C0007.m1815(strM4162, C0050.m8131(m424(), 2056, 1, 1768)) ? C0002.m1305(m424(), 2057, 98, 560) : C0007.m1815(strM4162, C0048.m7902(m424(), 2155, 1, 1473)) ? C0012.m2973(m424(), 2156, 98, 1408) : C0007.m1840();
                String strM4163 = m416(m426(jsonObjectM430, C0021.m4340(m424(), 2254, 3, 2521)));
                if (C0007.m1815(strM4163, C0044.m7509(m424(), 2257, 2, 2690))) {
                    strM4163 = C0057.m8978(m424(), 2259, 2, 1527);
                } else if (C0007.m1815(strM4163, C0016.m3525(m424(), 2261, 2, 2799))) {
                    strM4163 = C0030.m5362(m424(), 2263, 2, 3181);
                } else if (C0007.m1815(strM4163, C0010.m2300(m424(), 2265, 2, 2808))) {
                    strM4163 = C0046.m7718(m424(), 2267, 3, 3164);
                } else if (C0007.m1815(strM4163, C0064.m9599(m424(), 2270, 2, 1143))) {
                    strM4163 = C0005.m1645(m424(), 2272, 2, 630);
                }
                C0055.m8732(strM5188, strM416, strM6779, strM4163, arrayList);
            }
        }
        return C0047.m7783(arrayList);
    }
}